app/controllers/static_pages_controller.rb

SELECT  "video_categories".* FROM "video_categories" ORDER BY "video_categories"."id" ASC LIMIT $1  [["LIMIT", 1000]]
---
  def courses
    @courses_id_name = {}
    @courses_id_name_length = 0

    VideoCategory.find_each do |vc|